#### BuiltInFailures.ElectricalFailures Members

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ElectricalFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AllSlotsOnPanelOccupied | All slots on panel: [Panel Name] are occupied. Some circuits will be disconnected from this panel. |
| Public property Static member | BankDistanceSmallerThanDiameter | The distance value is smaller than the conduit diameter, please enter a larger value |
| Public property Static member | CableTrayModified | The cable tray has been modified to be in the opposite direction or insufficient space to create the required fittings. |
| Public property Static member | CannotAddMorePolesToCircuit | Empty slots are unavailable to hold the number of poles you specified for this spare. \nTo add more poles to this spare, you must free up slots by moving the circuits below the spare. |
| Public property Static member | CannotAssignSecondaryDistSysToCircuit | Cannot assign or add [Element] to Circuit. There is no assigned secondary distribution system for [Element]. |
| Public property Static member | CannotConnectDifferentDesignOptsObjects | Cannot add or assign [Element] to circuit. Electrical objects belonging to different design options cannot be connected. |
| Public property Static member | CannotCreatePanelScheduleDuetoNoDefaultTemplate | A panel schedule cannot be created for these panels. A default panel schedule template must be assigned for this template type. |
| Public property Static member | CannotRemoveMembersInCircuitHavingParent | You have selected elements that are connected to a Panel object in a Circuit. These elements cannot be removed from the Circuit. |
| Public property Static member | CircuitOverload | Total connected load for Circuit [Name] is exceeding 80% of the defined rating ([Rating Value]). |
| Public property Static member | CircuitsOverlapAndDeleteSpareSpace | More than one Spare/Space falls onto the same slot. These Spares/Spaces will be deleted. |
| Public property Static member | CircuitsOverlapDisconnectCircuits | More than one circuit falls onto the same slot. These circuits will be disconnected. |
| Public property Static member | ConduitModified | The conduit has been modified to be in the opposite direction or insufficient space to create the required fittings. |
| Public property Static member | ElementsBelongToOtherCircuit | You have selected elements that are already part of other Circuits that have assigned Panels. The elements you selected cannot be added to this Circuit. |
| Public property Static member | FamilyMismatchCircuit | The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit? |
| Public property Static member | FeedThroughLugsIsDisabled | The feed through lugs option is unchecked. |
| Public property Static member | FeedThroughLugsIsNotEnabledAndBindFormulaInFamily | Can't change connection type to Feed Through Lugs because Feed Through Lugs is unchecked. Enable Feed Through Lugs with related formula in family editor the Feed Through Lugs is mapped to. Select the panel -> Edit Family -> Family Types. |
| Public property Static member | FeedThroughLugsIsNotEnabledAndBindGlobalParam | Can't change connection type to Feed Through Lugs because Feed Through Lugs is not enabled. Enable Feed Through Lugs by enabling the global parameter that Feed Through Lugs is mapping. Click Manage tab -> Settings panel -> Global Parameters. |
| Public property Static member | FeedThroughLugsIsOccupied | The feed through lugs is in use by circuit [Element]. |
| Public property Static member | FeedThroughLugsIsOccupiedAndDisconnectOtherCircuits | The feed through lugs is occupied, so other circuits connected with feed through lugs will be disconnected from this panel [Panel Name]. |
| Public property Static member | InvalidApparentPowerDensity | The Apparent Power Density is invalid. Edit the Power Density and/or Power Factor to recalculate the Apparent Power Density. |
| Public property Static member | InvalidNumberOfCircuitValueForSwitchPanel | The number of circuits on the switchboard currently exceeds the value you entered. Reduce the number of circuits on the equipment before changing this value. |
| Public property Static member | InvalidNumwiresSinglephase | Invalid number of wires for single phase, only 2 and 3 are valid. |
| Public property Static member | InvalidPathOfParallelConduits | Invalid path of parallel conduits |
| Public property Static member | InvalidSpareSpace | The number of poles for a spare/space in a single phase, [wire] wires panel cannot exceed [value]. |
| Public property Static member | MaximumNumberOfPolesExceeded | You cannot add more poles to this spare, as doing so would exceed the maximum number of poles set for this equipment. |
| Public property Static member | MismatchConnectorDistSysToCircuit | Cannot add [Element] to Circuit. The Type for the available connector does not match the Type ([Name]) for the Circuit. |
| Public property Static member | MismatchNmbAssignedDistSysToCircuit | Cannot assign or add [Element] to Circuit. There is no assigned distribution system for [Element]. |
| Public property Static member | MismatchNmbOfPolesToCircuit | Cannot add [Element] to Circuit. The Number of Poles for [Element] does not match the Number of Poles ([Name]) for the Circuit. |
| Public property Static member | MismatchPoleBrakesSlotsNumbers | The number of pole breakers may not be less than the number of occupied slots. |
| Public property Static member | MismatchVoltageLineToLine | Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Line Voltage for [Element] (The Line to Line Voltage is specified in the assigned Distribution System). |
| Public property Static member | MismatchVoltageToCircuit | Cannot add [Element] to Circuit. The Voltage for [Element] is out of range for the Voltage ([Voltage Value]) for the Circuit. |
| Public property Static member | MissingOrInvalidWireSizeTable | Wire Size Table "[Fail Name]" is missing or invalid. Use Electrical Settings to select a valid Wire Size Table. |
| Public property Static member | NoAvailableMatchingConnector | Cannot add [Element] to Circuit. There is no available connector matching the Type ([Type Name]) for the Circuit. |
| Public property Static member | NotAllowedCableTrayConduitRotation | Don't allow to rotate a horizontal cable tray/conduit like this |
| Public property Static member | NotEnoughAvailSlotsAndLugsOnPanel | You can't connect to panel [Panel Name] because there aren't enough slots and Feed Through Lugs is occupied. \nYou can increase the [ParameterName] to be greater than [Number] to connect through breaker slots or you can disconnect existing Feed Through Lugs connection. |
| Public property Static member | NotEnoughAvailSlotsAndLugsOnSwitchPanel | You can't connect to switchboard [Panel Name] because there aren't enough space and circuit [Circuit Name] is set to Feed Through Lugs. \nYou can increase the number of circuits to be greater than [Number] to connect through breakers or you can disconnect circuit and select Feed Through Lugs again. |
| Public property Static member | NotEnoughAvailSlotsOnPanel | You can't change the connection type to Breakers connect to panel [Panel Name] because there aren't enough slots. \nYou can increase the [ParameterName] to be greater than [Number] to connect through breaker slots or open the panel schedule and manually reshuffle non - consecutive slots. |
| Public property Static member | NotEnoughRoomForParallelConduits | Due to changes in elevation, there is not enough room to generate all of the parallel conduits. As a result, some conduit segments have not been generated. |
| Public property Static member | NotEnoughRoomForParallelPipes | Due to changes in elevation, there is not enough room to generate all of the parallel pipes. As a result, some pipe segments have not been generated. |
| Public property Static member | NotEnoughSlotsOnlyLugAvailable | There aren't enough slots on panel [Panel Name], so the circuit will connect through Feed Through Lugs. |
| Public property Static member | NotEnoughSlotsOnlyLugAvailableForSwitchPanel | There aren't enough space on switchboard [Panel Name], so the circuit will connect through Feed Through Lugs. |
| Public property Static member | NotPositiveBendRadius | The value you entered for the bend radius is zero or a negative value. Enter a positive value. |
| Public property Static member | NotSupportConcentricBend | Conduit with Fittings do not support Concentric Bend Radius, the bend radius of the conduit fittings will be same. |
| Public property Static member | NumberOfCircuitFullOnSwitchPanel | You can't change the connection type to Breakers and connect to switchboard [Panel Name] because there aren't enough space. \nYou can increase the number of circuits to be greater than [Number] to connect through breakers. |
| Public property Static member | ObjsDemolished | Cannot assign [Element] to circuit. Objects that are demolished cannot be added to a circuit. |
| Public property Static member | PanelMismatchCircuitType | Cannot assign [Element] to Circuit. The Type for the panel does not match the Type ([Name]) for the Circuit. |
| Public property Static member | PanelMismatchDistSysWhenCircuitAssigned | The selected circuit was added to panel [Element], but the distribution system for the panel does not match the power connector definition on the panel. |
| Public property Static member | SelectedElementsArePartOfOtherCircuit | You have selected elements that are already part of other Circuits. They will be removed from the original Circuits and added to this one. |
| Public property Static member | SmallBendRadius | The value you entered for the bend radius for conduit is too small. Enter a larger value. |
| Public property Static member | UnsignedCircuit | Circuit is not assigned to a panel |
| Public property Static member | VoltageIsOutOfRange | Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Ground Voltage for [Element] (The Line to Ground Voltage is specified in the assigned Distribution System)." |
| Public property Static member | WireMaxSizeNonexistent | Cannot find max size in current wire type's material table. |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace